-- MySQL dump 10.13  Distrib 8.0.26, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: ssafyweb
-- ------------------------------------------------------
-- Server version	8.0.26

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `guestbook`
--

DROP TABLE IF EXISTS `guestbook`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `guestbook` (
  `articleno` int NOT NULL AUTO_INCREMENT,
  `userid` varchar(16) NOT NULL,
  `subject` varchar(100) NOT NULL,
  `content` varchar(2000) NOT NULL,
  `regtime` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`articleno`),
  KEY `guestbook_username_FK_idx` (`userid`),
  CONSTRAINT `guestbook_userid_FK` FOREIGN KEY (`userid`) REFERENCES `ssafy_member` (`userid`)
) ENGINE=InnoDB AUTO_INCREMENT=159 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `guestbook`
--

LOCK TABLES `guestbook` WRITE;
/*!40000 ALTER TABLE `guestbook` DISABLE KEYS */;
INSERT INTO `guestbook` VALUES (1,'oliver2','바뀐 제목','바뀐 내용 바뀐 내용 바뀐 내용','2021-10-21 04:03:36'),(2,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(3,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(4,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(5,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(6,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(7,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(8,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(9,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(10,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(11,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(12,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:44'),(13,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(14,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(15,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(16,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(17,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(18,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(19,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(20,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(21,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(22,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(23,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(24,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(25,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(26,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(27,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(28,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:45'),(29,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:46'),(30,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:46'),(31,'oliver2','sadfsdf','sdfasdfa','2021-10-21 04:06:46'),(62,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(63,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(64,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(65,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(66,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(67,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(68,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(69,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(70,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(71,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:49'),(72,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(73,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(74,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(75,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(76,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(77,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(78,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(79,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(80,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(81,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(82,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(83,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(84,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(85,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(86,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(87,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(88,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(89,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:50'),(90,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:51'),(91,'oliver2','우와우아우','으아으아으아\r\n으아으아으아\r\n으아으아으아','2021-10-21 04:14:51'),(92,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:45'),(93,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:45'),(94,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:45'),(95,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(96,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(97,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(98,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(99,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(100,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(101,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(102,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(103,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(104,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(105,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(106,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(107,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(108,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(109,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(110,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(111,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(112,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(113,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:46'),(114,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(115,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(116,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(117,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(118,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(119,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(120,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(121,'oliver2','금귤','감귤 에이드\r\n예','2021-10-21 04:15:47'),(122,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(123,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(124,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(125,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(126,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(127,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(128,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(129,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(130,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(131,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(132,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(133,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(134,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(135,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(136,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(137,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(138,'oliver2','그만','그만그만','2021-10-21 04:16:16'),(139,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(140,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(141,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(142,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(143,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(144,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(145,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(146,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(147,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(148,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(149,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(150,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(151,'oliver2','그만','그만그만','2021-10-21 04:16:17'),(156,'park','ㄱㄱㄱㄱ22','ㄴㄴㄴㄴㅇㅇ','2021-10-26 01:25:16'),(157,'park','xcvz','xzcv','2021-10-26 02:28:58'),(158,'admin','ㅇㄴㄻㄴㅇㄹ','ㄴㅇㄻㄴㅇㄻㄴㅇ','2021-10-29 04:25:49');
/*!40000 ALTER TABLE `guestbook` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2021-11-24 16:24:49
